app/Controllers/Api/AuthApiController.php

    public function me()
    {
        $authHeader = $this->request->getHeaderLine('Authorization');
        if (stripos($authHeader, 'Bearer ') !== 0) {
            return $this->failUnauthorized('Unauthorized');
        }
        $token = trim(substr($authHeader, 7));

        try {
            $payload = (new JwtService())->validate($token);
            $uid = (int) ($payload['sub'] ?? 0);
            if ($uid <= 0)
                return $this->failUnauthorized('Unauthorized');

            $ids = new UserIdentityModel();
            $identity = $ids->where('type', 'email_password')
                ->where('user_id', $uid)
                ->orderBy('id', 'DESC')
                ->first();
---
SELECT *
FROM `auth_identities`
WHERE `type` = 'email_password'
AND `user_id` = 1
ORDER BY `id` DESC
 LIMIT 1