app/Controllers/Api/BarangApi.php

            ->getResultArray();

        foreach ($rows as &$r) {
            $dip = $db->table('peminjaman_items pi')
                ->select('SUM(pi.requested_qty) AS qty_dipinjam')
                ->join('peminjaman p', 'p.id = pi.peminjaman_id')
                ->where('pi.barang_id', $r['id'])
                ->whereIn('p.status', ['draft', 'approved', 'returned', 'success'])
                ->get()
                ->getRowArray();
---
SELECT SUM(pi.requested_qty) AS qty_dipinjam
FROM `peminjaman_items` `pi`
JOIN `peminjaman` `p` ON `p`.`id` = `pi`.`peminjaman_id`
WHERE `pi`.`barang_id` = '3356'
AND `p`.`status` IN ('draft','approved','returned','success')

    public function show($id)
    {
        $db = \Config\Database::connect();

        $row = $db->table('barang')
            ->select('
            id, material, material_description, plant, material_group,
            storage_location, storage_location_desc, df_stor_loc_level,
            base_unit_of_measure, qty_unrestricted, qty_transit_and_transfer,
            qty_blocked, material_type, storage_id, import_batch,
            created_at, updated_at
        ')
            ->where('id', (int) $id)
            ->get()
            ->getRowArray();

        if (!$row) {
            return $this->failMsg('Barang tidak ditemukan', 404);
        }

        $fotos = $db->table('barang_foto')
            ->select('id, path, is_primary')
            ->where('barang_id', (int) $id)
            ->orderBy('is_primary', 'DESC')
            ->orderBy('id', 'ASC')
            ->get()
            ->getResultArray();

        $row['fotos'] = $fotos;

        $dip = $db->table('peminjaman_items pi')
            ->select('SUM(pi.requested_qty) AS qty_dipinjam')
            ->join('peminjaman p', 'p.id = pi.peminjaman_id')
            ->where('pi.barang_id', $id)
            ->whereIn('p.status', ['draft', 'approved', 'returned', 'success'])
            ->get()
            ->getRowArray();
---
SELECT `id`, `material`, `material_description`, `plant`, `material_group`, `storage_location`, `storage_location_desc`, `df_stor_loc_level`, `base_unit_of_measure`, `qty_unrestricted`, `qty_transit_and_transfer`, `qty_blocked`, `material_type`, `storage_id`, `import_batch`, `created_at`, `updated_at`
FROM `barang`
WHERE `id` = 24279
SELECT `id`, `path`, `is_primary`
FROM `barang_foto`
WHERE `barang_id` = 24279
ORDER BY `is_primary` DESC, `id` ASC
SELECT SUM(pi.requested_qty) AS qty_dipinjam
FROM `peminjaman_items` `pi`
JOIN `peminjaman` `p` ON `p`.`id` = `pi`.`peminjaman_id`
WHERE `pi`.`barang_id` = '24279'
AND `p`.`status` IN ('draft','approved','returned','success')