app/Controllers/Api/BarangApi.php

SELECT `barang`.`id`, `barang`.`material`, `barang`.`material_description`, `barang`.`plant`, `barang`.`storage_location`, `barang`.`storage_location_desc`, `barang`.`material_group`, `barang`.`base_unit_of_measure`, `barang`.`qty_unrestricted`, `barang`.`qty_transit_and_transfer`, `barang`.`qty_blocked`, `barang`.`material_type`, `barang`.`storage_id`, `barang`.`import_batch`, `barang`.`created_at`, `barang`.`updated_at`, `barang`.`harga`, `barang`.`total_harga`, `s`.`zone` AS `stor_zone`, `s`.`rack` AS `stor_rack`, `s`.`bin` AS `stor_bin`, `s`.`dak` AS `stor_dak`
FROM `barang`
LEFT JOIN `storages` `s` ON `s`.`id` = `barang`.`storage_id`
ORDER BY `barang`.`material` ASC
 LIMIT 50
---
        $rows = $b->select("
            barang.id,
            barang.material,
            barang.material_description,
            barang.plant,
            barang.storage_location,
            barang.storage_location_desc,
            barang.material_group,
            barang.base_unit_of_measure,
            barang.qty_unrestricted,
            barang.qty_transit_and_transfer,
            barang.qty_blocked,
            barang.material_type,
            barang.storage_id,
            barang.import_batch,
            barang.created_at,
            barang.updated_at,
            barang.harga,
            barang.total_harga,
            s.zone AS stor_zone,
            s.rack AS stor_rack,
            s.bin  AS stor_bin,
            s.dak  AS stor_dak
        ")
            ->join('storages s', 's.id = barang.storage_id', 'left')
            ->orderBy('barang.material', 'ASC')
            ->limit($per, $offset)
            ->get()
            ->getResultArray();