app/Controllers/Api/PeminjamanApi.php

    public function index()
    {
        $q        = trim((string) $this->request->getGet('q'));
        $status   = trim((string) $this->request->getGet('status'));
        $page    = max(1, (int) ($this->request->getGet('page') ?? 1));
        $perPage = min(200, max(1, (int) ($this->request->getGet('per_page') ?? 50)));

        $user = Auth::user();
        if (!$user) {
            return $this->fail('Unauthorized', 401);
        }

        $role = strtolower($user['role']);
        $uid  = (int) $user['id'];
        $plant = $this->resolvePlant();

        $b = $this->db->table('peminjaman p')
            ->select("
                p.id,
                p.no_nota AS nomor,
                DATE(p.borrow_date) AS tanggal,
                p.status,
                p.pic,
                p.sub_bagian,
                p.note,
                p.peminjam_id,
                u.username AS peminjam_username,
                GROUP_CONCAT(DISTINCT b.plant ORDER BY b.plant SEPARATOR ',') AS plants
            ", false)
            ->join('users u', 'u.id = p.peminjam_id', 'left')
            ->join('peminjaman_items pi', 'pi.peminjaman_id = p.id', 'left')
            ->join('barang b', 'b.id = pi.barang_id', 'left');
---
SELECT p.id,
                p.no_nota AS nomor,
                DATE(p.borrow_date) AS tanggal,
                p.status,
                p.pic,
                p.sub_bagian,
                p.note,
                p.peminjam_id,
                u.username AS peminjam_username,
                GROUP_CONCAT(DISTINCT b.plant ORDER BY b.plant SEPARATOR ',') AS plants, COUNT(DISTINCT p.id) AS c
FROM `peminjaman` `p`
LEFT JOIN `users` `u` ON `u`.`id` = `p`.`peminjam_id`
LEFT JOIN `peminjaman_items` `pi` ON `pi`.`peminjaman_id` = `p`.`id`
LEFT JOIN `barang` `b` ON `b`.`id` = `pi`.`barang_id`
WHERE   (
b.plant IS NOT NULL
 )
GROUP BY `p`.`id`

    public function show($id)
    {
        $id = (int) $id;

        $user = Auth::user();
        if (!$user) {
            return $this->fail('Unauthorized', 401);
        }

        $role = strtolower($user['role']);
        $uid  = (int) $user['id'];
        $plant = $this->resolvePlant();

        $row = $this->db->table('peminjaman p')
            ->select('
                p.id,
                p.no_nota AS nomor,
                DATE(p.borrow_date) AS tanggal,
                DATE(p.due_date) AS jatuh_tempo,
                p.status,
                p.pic,
                p.sub_bagian,
                p.note,
                p.peminjam_id,
                u.username AS peminjam_username
            ')
            ->join('users u', 'u.id = p.peminjam_id', 'left')
            ->where('p.id', $id)
            ->get()
            ->getRowArray();
---
SELECT `p`.`id`, `p`.`no_nota` AS `nomor`, DATE(p.borrow_date) AS tanggal, DATE(p.due_date)    AS jatuh_tempo, `p`.`status`, `p`.`pic`, `p`.`sub_bagian`, `p`.`note`, `p`.`peminjam_id`, `u`.`username` AS `peminjam_username`, `p`.`created_at`, `p`.`updated_at`
FROM `peminjaman` `p`
LEFT JOIN `users` `u` ON `u`.`id` = `p`.`peminjam_id`
WHERE `p`.`id` = 25