app/Controllers/Api/PeminjamanApi.php

            return $this->failMsg('Forbidden: tidak boleh akses data orang lain', 403);
        }

        $plants = $this->db->table('peminjaman_items pi')
            ->select('GROUP_CONCAT(DISTINCT b.plant ORDER BY b.plant SEPARATOR ",") AS plants', false)
            ->join('barang b', 'b.id = pi.barang_id', 'left')
            ->where('pi.peminjaman_id', $id)
            ->get()->getRowArray();
---
SELECT GROUP_CONCAT(DISTINCT b.plant ORDER BY b.plant SEPARATOR ",") AS plants
FROM `peminjaman_items` `pi`
LEFT JOIN `barang` `b` ON `b`.`id` = `pi`.`barang_id`
WHERE `pi`.`peminjaman_id` = 25