app/Controllers/Api/ReservasiApi.php

    public function index()
    {
        $q    = trim((string) $this->request->getGet('q'));
        $sloc = trim((string) $this->request->getGet('sloc'));

        $page    = max(1, (int) ($this->request->getGet('page') ?? 1));
        $perPage = min(200, max(1, (int) ($this->request->getGet('per_page') ?? 50)));
        $offset  = ($page - 1) * $perPage;

        $plant = $this->resolvePlant();

        if ($plant === null && strtolower(Auth::role() ?? '') !== 'super_admin') {
            return $this->fail('Plant user tidak valid', 403);
        }

        $b = $this->db->table('reservasi_list r')
            ->select("
            r.id,
            r.material,
            r.material_description,
            r.plant,
            r.storage_location,
            r.posting_date,
            r.qty_in_un_of_entry,
            r.purchase_order,
            r.reservation,
            r.user_name,
            r.batch,
            r.movement_type,
            r.material_document,
            r.text
        ", false);
---
SELECT r.id,
            r.material,
            r.material_description,
            r.plant,
            r.storage_location,
            r.posting_date,
            r.qty_in_un_of_entry,
            r.purchase_order,
            r.reservation,
            r.user_name,
            r.batch,
            r.movement_type,
            r.material_document,
            r.text, COUNT(*) AS c
FROM `reservasi_list` `r`