app/Controllers/Api/StatsApi.php

    public function dashboard()
    {
        $db = \Config\Database::connect();
        $plant = $this->resolvePlant();

        return $this->ok([
            'material_total'     => $this->countWithPlant($db, 'barang', $plant),
            'peminjaman_total'   => $this->countWithPlantFirstExisting(
                $db,
                ['peminjaman', 'peminjaman_header'],
                $plant
            ),
            'stock_opname_total' => $this->countWithPlantFirstExisting(
                $db,
                ['stock_opname_sessions', 'stock_opname', 'so_sessions'],
                $plant
            ),
        ]);
---
SELECT COUNT(*) AS `numrows`
FROM `peminjaman`
SELECT COUNT(*) AS `numrows`
FROM `barang`
SELECT COUNT(*) AS `numrows`
FROM `stock_opname_sessions`