app/Filters/JwtAuthFilter.php

            }

            $idModel = new UserIdentityModel();
            $identity = $idModel->where('type', 'email_password')
                ->where('user_id', $sub)
                ->orderBy('id', 'DESC')
                ->first();
---
SELECT *
FROM `auth_identities`
WHERE `type` = 'email_password'
AND `user_id` = 1
ORDER BY `id` DESC
 LIMIT 1