app/Filters/JwtAuthFilter.php

SELECT `id`, `username`, `role`, `plant`
FROM `users`
WHERE `id` = 1
---
            }

            $db = \Config\Database::connect();
            $user = $db->table('users')
                ->select('id, username, role, plant')
                ->where('id', $userId)
                ->get()
                ->getRowArray();