app/Controllers/QrGeneratorController.php

SELECT COUNT(*) AS `numrows`
FROM `barang`
SELECT `id`, `material`, `material_description`
FROM `barang`
ORDER BY `material` ASC
 LIMIT 25
---
    public function index()
    {
        $db = \Config\Database::connect();

        $q = trim((string) $this->request->getGet('q'));
        $page = (int) ($this->request->getGet('page') ?? 1);
        $perPage = 25;
        $offset = ($page - 1) * $perPage;

        $builder = $db->table('barang')->select('id, material, material_description');

        if ($q !== '') {
            $builder->groupStart()
                ->like('material', $q)
                ->orLike('material_description', $q)
                ->groupEnd();
        }

        $total = $builder->countAllResults(false);

        $barang = $builder
            ->orderBy('material', 'ASC')
            ->limit($perPage, $offset)
            ->get()
            ->getResultArray();

SELECT `material`, `material_description`
FROM `barang`
WHERE `id` IN ('1')
ORDER BY `material` ASC
---
    public function generate()
    {
        $ids = (array) $this->request->getPost('barang_ids');

        if (!$ids) {
            return redirect()->back()->with('error', 'Pilih minimal satu barang.');
        }

        $db = \Config\Database::connect();

        $items = $db->table('barang')
            ->whereIn('id', $ids)
            ->select('material, material_description')
            ->orderBy('material', 'ASC')
            ->get()
            ->getResultArray();