app/Controllers/StockPredictController.php

SELECT COUNT(*) AS `numrows`
FROM `v_barang_demand_summary`
SELECT *
FROM `v_barang_demand_summary`
ORDER BY `material` ASC
 LIMIT 25
---
    public function index()
    {
        $db = Database::connect();

        $page = (int) ($this->request->getGet('page') ?? 1);
        $perPage = (int) ($this->request->getGet('per_page') ?? 25);
        $offset = ($page - 1) * $perPage;
        $q = trim((string) $this->request->getGet('q') ?? '');

        $builder = $db->table('v_barang_demand_summary');
        if ($q !== '') {
            $builder->groupStart()
                ->like('material', $q)
                ->orLike('material_description', $q)
                ->groupEnd();
        }

        $total = $builder->countAllResults(false);
        $rows = $builder
            ->orderBy('material', 'ASC')
            ->limit($perPage, $offset)
            ->get()
            ->getResultArray();