app/Models/UserIdentityModel.php

SELECT *
FROM `auth_identities`
WHERE `type` = 'email_password'
AND   (
`secret` = 'admin'
OR `name` = 'admin'
 )
ORDER BY `id` DESC
 LIMIT 1
---
    public function findByEmailOrUsername(string $identity): ?array
    {
        $row = $this->where('type', 'email_password')
            ->groupStart()
            ->where('secret', $identity)
            ->orWhere('name', $identity)
            ->groupEnd()
            ->orderBy('id', 'DESC')
            ->first();

SELECT `role`
FROM `users`
WHERE `id` = 1
 LIMIT 1
---
    public function getRoleByUserId(int $userId): string
    {
        $db = $this->db;
        $role = null;

        try {
            if ($db->tableExists('users')) {
                $u = $db->table('users')
                    ->select('role')
                    ->where('id', $userId)
                    ->limit(1)
                    ->get()
                    ->getRowArray();