app/Libraries/ReservasiExcel.php

SELECT *
FROM `reservasi_list`
WHERE `material` = '2Y-AKSRNT-SEN100'
AND `plant` = '1200'
AND `storage_location` = '2691'
AND `posting_date` = '2025-11-03'
AND `reservation` = '11709632'
AND `purchase_order` = ''
---
    protected function upsertReservasi(BaseConnection $db, array $d): array
    {
        $old = $db->table('reservasi_list')
            ->where([
                'material' => $d['material'],
                'plant' => $d['plant'],
                'storage_location' => $d['storage_location'],
                'posting_date' => $d['posting_date'],
                'reservation' => $d['reservation'],
                'purchase_order' => $d['purchase_order'],
            ])
            ->get()
            ->getRowArray();